system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

para {#include        "../Parameters"}

scale 1;

vertices
(
    ($para/xmin $para/ymin $para/z0)
    ($para/xmax $para/ymin $para/z0)
    ($para/xmax $para/ymax $para/z0)
    ($para/xmin $para/ymax $para/z0)

    ($para/xmin $para/ymin $para/z1)
    ($para/xmax $para/ymin $para/z1)
    ($para/xmax $para/ymax $para/z1)
    ($para/xmin $para/ymax $para/z1)

    ($para/xmin $para/ymin $para/z2)
    ($para/xmax $para/ymin $para/z2)
    ($para/xmax $para/ymax $para/z2)
    ($para/xmin $para/ymax $para/z2)

    ($para/xmin $para/ymin $para/z3)
    ($para/xmax $para/ymin $para/z3)
    ($para/xmax $para/ymax $para/z3)
    ($para/xmin $para/ymax $para/z3)

    ($para/xmin $para/ymin $para/z4)
    ($para/xmax $para/ymin $para/z4)
    ($para/xmax $para/ymax $para/z4)
    ($para/xmin $para/ymax $para/z4)

    ($para/xmin $para/ymin $para/z5)
    ($para/xmax $para/ymin $para/z5)
    ($para/xmax $para/ymax $para/z5)
    ($para/xmin $para/ymax $para/z5)

    ($para/xmin $para/ymin $para/z6)
    ($para/xmax $para/ymin $para/z6)
    ($para/xmax $para/ymax $para/z6)
    ($para/xmin $para/ymax $para/z6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($para/xcells $para/ycells $para/zcells01) simpleGrading (1 $para/yGrading $para/zGrading01)
    hex (4 5 6 7 8 9 10 11) ($para/xcells $para/ycells $para/zcells12) simpleGrading (1 $para/yGrading $para/zGrading12)
    hex (8 9 10 11 12 13 14 15) ($para/xcells $para/ycells $para/zcells23) simpleGrading (1 $para/yGrading $para/zGrading23)
    hex (12 13 14 15 16 17 18 19) ($para/xcells $para/ycells $para/zcells34) simpleGrading (1 $para/yGrading $para/zGrading34)
    hex (16 17 18 19 20 21 22 23) ($para/xcells $para/ycells $para/zcells45) simpleGrading (1 $para/yGrading $para/zGrading45)
    hex (20 21 22 23 24 25 26 27) ($para/xcells $para/ycells $para/zcells56) simpleGrading (1 $para/yGrading $para/zGrading56)
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (24 25 26 27)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
            (13 14 18 17)
            (17 18 22 21)
            (21 22 26 25)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (8 12 15 11)
            (12 16 19 15)
            (16 20 23 19)
            (20 24 27 23)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    side
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            (16 17 21 20)
            (20 21 25 24)
        );
    }
    midPlane
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
            (11 15 14 10)
            (15 19 18 14)
            (19 23 22 18)
            (23 27 26 22)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
